assets/aircanada-order.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://sita.aero/NDC/NDCUtility/v2">
    <soapenv:Header />
    <soapenv:Body>
        <v2:NDCMSG_Envelope>
            <NDCMSG_Header>
                <Function>AirShoppingRQ</Function>
                <SchemaType>NDC</SchemaType>
                <SchemaVersion>YY.2017.2</SchemaVersion>
                <RichMedia>true</RichMedia>
                <Sender>
                    <Address>
                        <Company>WindingTree</Company>
                        <NDCSystemId>DEV</NDCSystemId>
                    </Address>
                </Sender>
                <Recipient>
                    <Address>
                        <Company>AC</Company>
                        <NDCSystemId>DEV</NDCSystemId>
                    </Address>
                </Recipient>
            </NDCMSG_Header>
            <NDCMSG_Body>
                <NDCMSG_Payload>
                    <OrderCreateRQ Version="2017.2" PrimaryLangID="EN" xmlns="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="">
                        <apiKey>74f19d8f71d5a6da1e98874fa3adea08</apiKey>
                        <commission>0</commission>
                        <AirlineID>AC</AirlineID>
                        <PointOfSale>
                            <TouchPoint>
                                <Device>
                                    <Code>0.AAA.X</Code>
                                    <TableName />
                                </Device>
                            </TouchPoint>
                        </PointOfSale>
                        <Document id="OneWay">
                            <Name>NDC-Exchange</Name>
                            <ReferenceVersion>UAT-OTA-2010B</ReferenceVersion>
                        </Document>
                        <Party>
                            <Participants>
                                <Participant>
                                    <EnabledSystemParticipant SequenceNumber="1">
                                        <Name>WindingTreePOSCA</Name>
                                        <Category>DC</Category>
                                        <SystemID Owner="ADS">mcmEL4qB</SystemID>
                                    </EnabledSystemParticipant>
                                </Participant>
                            </Participants>
                        </Party>
                        <Query>
                            <Order>
                                <Offer Owner="AC" OfferID="VQQRSL0QU7-OfferID-1" ResponseID="">
                                    <TotalOfferPrice Code="CAD">964.29</TotalOfferPrice>
                                    <OfferItem OfferItemID="YF2KVTHZBN-OfferItemID-1">
                                        <PassengerRefs>QMH47WJI87-T1 IWXKIQ3T75-T2</PassengerRefs>
                                    </OfferItem>
                                    <OfferItem OfferItemID="JFOM7W4I30-OfferItemID-2">
                                        <PassengerRefs>H60W02HXAG-T3</PassengerRefs>
                                    </OfferItem>
                                </Offer>
                            </Order>
                            <DataList>
                                <passengers>
                                    <PAX1>
                                        <type>ADT</type>
                                        <civility>MR</civility>
                                        <lastnames>Marley</lastnames>
                                        <firstnames>Bob</firstnames>
                                        <birthdate>1980-03-21T00:00:00Z</birthdate>
                                        <contactInformation>+32123456789</contactInformation>
                                        <contactInformation>contact@org.co.uk</contactInformation>
                                    </PAX1>
                                </passengers>
                            </DataList>
                        </Query>
                    </OrderCreateRQ>
                </NDCMSG_Payload>
            </NDCMSG_Body>
        </v2:NDCMSG_Envelope>
    </soapenv:Body>
</soapenv:Envelope>